{"title":"","uid":"f73a8e23e6f6f669cf99c7dba8fa0722","slug":"To me","date":"2024-10-19T07:31:15.694Z","updated":"2024-10-19T07:31:18.755Z","comments":true,"path":"api/articles/To me.json","keywords":null,"cover":null,"content":"<h1 id=\"To-me\"><a href=\"#To-me\" class=\"headerlink\" title=\"To me\"></a>To me</h1><p>时光荏苒啊，果然计划是赶不上变化的，我可真是善变，上一篇to me是在今年年初的时候写的，现在24年也将迎来尾声，这一年可以说是我经历最丰富的一年了，让我觉得过得很快又很慢，一切都在我的不知不觉间改变，就连我自己也是如此，闲来无事遂来留此致我。</p>\n<p>在经历的年初短暂的闲暇，踏上了独自前往苏州的实习之路，机缘巧合又回到了武汉，历经了从毕业论文到独自项目开发的任务，一切都似乎慢慢走上了正轨，我的计划似乎也在稳步的进行，我的性格似乎也在不知不觉间发生了改变。但是有些变化反而是令我觉得措手不及的，以前一起游玩的好友也都似乎去与生活对线了，很难再凑齐足够的人数，能够短暂的相聚的时光反而显得弥足的漫长与珍贵。但是时间依然在继续，我明白一切都已发生了改变，我需要新的东西来填补我所缺失的部分，遂立笔与此。</p>\n<p>最近在读叔本华的《人生的智慧》这一本书，我的运气还是很不错的，在机缘巧合的推动下简历都没有带就回到了武汉得到了一份比较轻松的工作，但是生活对他人的改变反而是最令我最措手不及的。我很难再找到有时间一起游玩的好友，我那弥足珍贵的闲暇时间竟然将我带到了可怕的无聊之中。我在无聊之中偶尔刷到v2上有此类似的话题，看到不少的朋友推荐《人生的智慧》这一书，遂开始阅读，并没有读完但已觉得获益良多。但有不少的观点对我而言并不太认可，可能是受限于我自身的环境与年龄，当我再次选择回看这本书的时候定会有新的感悟，届时将交给那时的我来写出新一篇的致我。</p>\n<p>人的一生就像是一场拔河，不过你并不是两边博弈的选手，而是中间判断胜负的那一个标杆，不过可惜的是这场拔河永远都不会结束，永远都不能决定出胜者，只能循环往复来回拉扯。两边博弈的选手则是痛苦与无聊，当一个人需要为物质生活而费劲心思而不断操劳得不到足够的闲暇时光就会变得痛苦不堪，这时痛苦将会占据上风，无情的嘲笑者每一个因物质奔波的痛苦者。而无聊甚至得不到出场的机会，痛苦会以压倒性的优势占据着痛苦者的每一处。这也是大多数人的境遇，社会的异化和对人的压迫使得痛苦弥漫在广大底层阶级中。而如果你的运气很好，投了个好胎，在羊水里战胜了绝大多数的人，不必为物质条件去奔波操劳，整日只需游山玩水。这时你就会遇上你的一生之敌——无聊，它会如蛆附骨一般在你的每一个闲暇时光入侵你生活的每一个角落。你的运气很好，拥有大量的闲暇时光，但是现在，闲暇的时光变成了蚀骨的毒药。在每一个闲暇你就会开始同无聊开始一场毫无胜算，堪称绝望的战斗，你会试着用你最大的利器——你那优渥的物质条件去和它搏斗，你会获得短暂的胜利，但你的每一次胜利都会使得自己的空虚扩大，无聊将会慢慢得污染每一个让你获得胜利的条件。你的阈值将会被慢慢的拔高，直到做出偏激违法的事情，走向灭亡的深渊。</p>\n<p>那么此题要如何解开呢？答案当然有，我们无法避免的会参与到这场拉锯战中，而我们要做的事便是维持好两者的平衡，不可避免的偶尔会有一方占据到优势，我们要做的事情便是使一方的优势化为乌有来维持好平衡。通过自身的努力或许做不到完完全全不需要对物质操劳，但是至少可以减少对物质操劳的时间来获取足够的闲暇时光，而这段时光也不能被无聊所污染，需要我们通过强大的内在来与它进行对抗。我们的利器可以是多种多样的，爱好，兴趣，热爱和情感足以帮助我们来战胜它，最重要的是活在当下，去享受这段时间，而不是让无聊去污染它，去做任何你想做的事情，或许这样才是得到幸福的关键。</p>\n<p>叔本华自诩这本书或许可以叫做幸福论，也就是说这其实是一本方法论，这一下子就提起了我的兴趣，方法论在我眼里有着极其重要的特性，是事半功倍的关键，而事实上也确实给出了答案。幸福最重要的因素是我们自身，所有的一切所发生的事情其实都是只存在于我们的意识之中，同一件事如何去看待它完完全全取决于我们自己。物质在这里也同样重要，对抗无聊的基础便是物质，没有足够的物质那么你便会陷入无尽的痛苦之中，但是获得物质的时候很容易发生本末倒置的情况。首先要明确物质只是我们获得幸福的手段，而不是目标，如果当物质变成了目标的时候就会陷入以物质对抗无聊的陷阱之中，最后的结果必然是惨败。</p>\n<p>此外书中还有一段关于虚荣与骄傲的辩论令我印象很深，骄傲是强大的而虚荣是一文不值的。这里的骄傲的定义是对自身某一完全处于自身的某项力量的自信，它必须是完完全全的出自于自身，而不是外物了的，它能使人强大起来。而虚荣则是完全相反的，它完完全全取决于外物，取决于他人的判断，他人的评价对我们而言是有一定的重要性，但是并非达到幸福之中分量较为重要的，正如这个词一样，是虚假的，经不起考验的。补充一下获得他人对我们良好的评价对我们而言也是一种手段，目的也可以是获得物质或者幸福。但是始终记住，获得幸福的关键在于我们自身的强大。</p>\n<p>有关这本书的论述就到此为止，这些是我在最近的阅读中印象比较深的部分，也是获益良多的部分，尤其是手段于目的的辩数及时点醒了我。</p>\n<p>接下来将回到我自己身上，光是论是没有用的，知行合一才是难点，我有幸不必于痛苦过多的缠斗，但却不得不陷于与无聊的抗争之中，所有在这里也为我的武器列出清单</p>\n<ol>\n<li>音乐，这是我的利器。我很喜欢音乐，没有音乐的世界会让我觉得无趣，所以我决定去学习钢琴，它能表达我的情感，提升我自己</li>\n<li>阅读，我已经好久没有完整的读完一本书了，我越来越难以平静下来，这并不好，所有我会重新开始阅读，《人生的智慧》便是新的开始</li>\n<li>健身，健康的身体是幸福最重要的组成，没有之一。此外，我不要当细狗！</li>\n<li>娱乐，游戏在我生活中的比重越来越小了，这说不定是件好事，可以拥有时间去提升自己；此外台球是个很好的选择，我很喜欢</li>\n<li>不要熬夜，其实应该放在健身里面的，但是它实在是太重要了，我选择单独列举出来，已经开始早睡一周了，效果真的显著</li>\n</ol>\n<p>此外就是我全新的职业规划</p>\n<p>我回到了我熟悉的工控领域，但是同时也有了新的思考，只是技术这条路线并不能让我尽早的满足物质需求，我的技术之路可能走不长远，我并非什么杰出的天才，但是我还是想以此为切入点去熟悉这个行业，我相信这并不是无用功，就如我之前的经历能够让我在一群人中不需要简历就能脱颖而出。最重要的东西应该是渠道和资源，即让别人知道你和告诉别人你能给他带来什么，想清楚了之后那么对应的职业也便浮现出来，这便是销售，成为一个优秀的技术型销售这便是我全新的目标，这个目标将会定在三到五年内实施（今年是第一年）。我对这个社会运转的逻辑还不够清楚，我对行业的现状还不够了解，我的视野还不够广阔，但是早晚有一天我能达到足够了解的水准，加油，做一个幸福的人！</p>\n<p>2024年10月19日</p>\n","feature":true,"text":"To me时光荏苒啊，果然计划是赶不上变化的，我可真是善变，上一篇to me是在今年年初的时候写的，现在24年也将迎来尾声，这一年可以说是我经历最丰富的一年了，...","permalink":"/post/To me","photos":[],"count_time":{"symbolsCount":"2.7k","symbolsTime":"2 mins."},"categories":[],"tags":[],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#To-me\"><span class=\"toc-text\">To me</span></a></li></ol>","author":{"name":"时雨","slug":"blog-author","avatar":"https://s2.loli.net/2024/01/28/mshkqWEFbd1xBIU.jpg","link":"/","description":"特别鸣谢你制造更欢乐的我<p>Yesterday is history</p><p>Tomorrow is mystery</p><p>Today is a gift</p>","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"mapped":true,"hidden":false,"prev_post":{},"next_post":{"title":"SQLSever基础","uid":"641632e2596cda11898ff146651ae4ce","slug":"SqlSever","date":"2023-11-18T13:28:20.000Z","updated":"2024-02-17T09:31:35.640Z","comments":true,"path":"api/articles/SqlSever.json","keywords":null,"cover":"https://smms.app/image/4MbfVDKdrzgoIeS","text":"SqlSever基础建库使用ssms建立数据库主要数据文件：*.mdf 日志文件：*.ldf 次要数据文件：*.ndf 使用sql语句建立数据库使用创建关键字c...","permalink":"/post/SqlSever","photos":[],"count_time":{"symbolsCount":"6.2k","symbolsTime":"6 mins."},"categories":[{"name":"数据库","slug":"数据库","count":1,"path":"api/categories/数据库.json"}],"tags":[{"name":"SqlSever","slug":"SqlSever","count":1,"path":"api/tags/SqlSever.json"}],"author":{"name":"时雨","slug":"blog-author","avatar":"https://s2.loli.net/2024/01/28/mshkqWEFbd1xBIU.jpg","link":"/","description":"特别鸣谢你制造更欢乐的我<p>Yesterday is history</p><p>Tomorrow is mystery</p><p>Today is a gift</p>","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"feature":true}}